app/controllers/topics_controller.rb

def create
  @topic = Topic.new(params[:topic])
  if @topic.save
---
INSERT INTO "topics" ("name", "last_post_at", "created_at", "updated_at", "last_poster_id", "forum_id") VALUES('Lorem Ipsum Set amet', NULL, '2010-02-16 02:44:22', '2010-02-16 02:44:22', NULL, NULL)